In [2]:
import pymongo as mongo
import pandas as pd
import csv

In [4]:
connection_str = 'mongodb://localhost:27017/'
database = "recommender_app_data"

In [5]:
client = mongo.MongoClient(connection_str)
db = client[database]

In [12]:
def get_data(coll_name):
    coll_df = db[coll_name]
    data = list(coll_df.find())
    df = pd.DataFrame(data, index = None)
    df.drop(['_id'], axis=1, inplace=True)
    return df

In [13]:
books_df = get_data("books_data")

In [14]:
books_df.head(5)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-L
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...

In [15]:
ratings_df = get_data("ratings_data")

In [17]:
ratings_df.head(5)

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726   155061224            5
2   276727   446520802            0
3   276729  052165615X            3
4   276729   521795028            6

In [18]:
users_df = get_data("users_data")

In [19]:
users_df.head(5)

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN